#ifndef POKEHEARTGOLD_POKEDEX_H
#define POKEHEARTGOLD_POKEDEX_H

typedef struct
{
    /*0x0*/ void *gameData;
    /*0x4*/ int playerInfo;
    /*0x8*/ int unk8;
} PokeDexSeacherEngine;

typedef struct
{
    /*0x0*/ void *gameData;
    /*0x4*/ int dexSave;
    /*0x8*/ int playerInfo;
    /*0xC*/ u16 unkC;
    /*0xE*/ u16 unkE;
} PokeDexParamInput;

typedef struct
{
    /*0x0*/ PokeDexParamInput *inputParam;
    /*0x4*/ int unk4;
    /*0x8*/ int unk8;
    /*0xC*/ void *unkC;
    /*0x10*/ u16 unk10;
    /*0x12*/ u16 unk12;
    /*0x14*/ void *unk14;
    /*0x18*/ u16 unk18;
    /*0x1A*/ u16 unk1A;
    /*0x1C*/ int unk1C;
    /*0x20*/ int unk20;
    /*0x24*/ int unk24;
    /*0x28*/ int unk28;
    /*0x2C*/ int unk2C;
    /*0x30*/ int unk30;
    /*0x34*/ int unk34;
    /*0x38*/ PokeDexSeacherEngine *unk38;
} PokeDexStartView;

typedef int (*DexViewFunc)(PokeDexStartView *);

typedef struct
{
    /*0x0*/ int unk0;
    /*0x4*/ int unk4;
    /*0x8*/ int unk8;
    /*0xC*/ int unkC;
    /*0x10*/ u16 unk10;
    /*0x12*/ u16 unk12;
    /*0x14*/ int unk14;
    /*0x18*/ int unk18;
    /*0x1C*/ int unk1C;
    /*0x20*/ int unk20;
    /*0x24*/ int unk24;
    /*0x28*/ int unk28;
    /*0x2C*/ int unk2C;
    /*0x30*/ int unk30;
    /*0x34*/ int unk34;
    /*0x38*/ int unk38;
    /*0x3C*/ int unk3C;
    /*0x40*/ int unk40;
    /*0x44*/ int unk44;
    /*0x48*/ int unk48;
    /*0x4C*/ int unk4C;
    /*0x50*/ int unk50;
    /*0x54*/ int unk54;
    /*0x58*/ int unk58;
    /*0x5C*/ int unk5C;
    /*0x60*/ int unk60;
    /*0x64*/ int unk64;
    /*0x68*/ int unk68;
    /*0x6C*/ int unk6C;
    /*0x70*/ int unk70;
    /*0x74*/ int unk74;
    /*0x78*/ int unk78;
    /*0x7C*/ int unk7C;
    /*0x80*/ int unk80;
    /*0x84*/ int unk84;
    /*0x88*/ int unk88;
    /*0x8C*/ int unk8C;
    /*0x90*/ int unk90;
    /*0x94*/ int unk94;
    /*0x98*/ int unk98;
    /*0x9C*/ int unk9C;
    /*0xA0*/ int unkA0;
    /*0xA4*/ int unkA4;
    /*0xA8*/ int unkA8;
    /*0xAC*/ int unkAC;
    /*0xB0*/ int unkB0;
    /*0xB4*/ int unkB4;
    /*0xB8*/ int unkB8;
    /*0xBC*/ int unkBC;
    /*0xC0*/ int unkC0;
    /*0xC4*/ int unkC4;
    /*0xC8*/ int unkC8;
    /*0xCC*/ int unkCC;
    /*0xD0*/ int unkD0;
    /*0xD4*/ int unkD4;
    /*0xD8*/ int unkD8;
    /*0xDC*/ int unkDC;
    /*0xE0*/ int unkE0;
    /*0xE4*/ int unkE4;
    /*0xE8*/ int unkE8;
    /*0xEC*/ int unkEC;
    /*0xF0*/ int unkF0;
    /*0xF4*/ int unkF4;
    /*0xF8*/ int unkF8;
    /*0xFC*/ int unkFC;
    /*0x100*/ int unk100;
    /*0x104*/ int unk104;
    /*0x108*/ int unk108;
    /*0x10C*/ int unk10C;
    /*0x110*/ int unk110;
    /*0x114*/ int unk114;
    /*0x118*/ int unk118;
    /*0x11C*/ int unk11C;
    /*0x120*/ int unk120;
    /*0x124*/ int unk124;
    /*0x128*/ int unk128;
    /*0x12C*/ int unk12C;
    /*0x130*/ int unk130;
    /*0x134*/ int unk134;
    /*0x138*/ int unk138;
    /*0x13C*/ int unk13C;
    /*0x140*/ int unk140;
    /*0x144*/ int unk144;
    /*0x148*/ int unk148;
    /*0x14C*/ int unk14C;
    /*0x150*/ int unk150;
    /*0x154*/ int unk154;
    /*0x158*/ int unk158;
    /*0x15C*/ int unk15C;
    /*0x160*/ int unk160;
    /*0x164*/ int unk164;
    /*0x168*/ int unk168;
    /*0x16C*/ int unk16C;
    /*0x170*/ int unk170;
    /*0x174*/ int unk174;
    /*0x178*/ int unk178;
    /*0x17C*/ int unk17C;
    /*0x180*/ int unk180;
    /*0x184*/ int unk184;
    /*0x188*/ int unk188;
    /*0x18C*/ int unk18C;
    /*0x190*/ int unk190;
    /*0x194*/ int unk194;
    /*0x198*/ int unk198;
    /*0x19C*/ int unk19C;
    /*0x1A0*/ int unk1A0;
    /*0x1A4*/ int unk1A4;
    /*0x1A8*/ int unk1A8;
    /*0x1AC*/ int unk1AC;
    /*0x1B0*/ int unk1B0;
    /*0x1B4*/ int unk1B4;
    /*0x1B8*/ int unk1B8;
    /*0x1BC*/ int unk1BC;
    /*0x1C0*/ int unk1C0;
    /*0x1C4*/ int unk1C4;
    /*0x1C8*/ int unk1C8;
    /*0x1CC*/ int unk1CC;
    /*0x1D0*/ int unk1D0;
    /*0x1D4*/ int unk1D4;
    /*0x1D8*/ int unk1D8;
    /*0x1DC*/ int unk1DC;
    /*0x1E0*/ int unk1E0;
    /*0x1E4*/ int unk1E4;
    /*0x1E8*/ int unk1E8;
    /*0x1EC*/ int unk1EC;
    /*0x1F0*/ int unk1F0;
    /*0x1F4*/ int unk1F4;
    /*0x1F8*/ int unk1F8;
    /*0x1FC*/ int unk1FC;
    /*0x200*/ int unk200;
    /*0x204*/ int unk204;
    /*0x208*/ int unk208;
    /*0x20C*/ int unk20C;
    /*0x210*/ int unk210;
    /*0x214*/ int unk214;
    /*0x218*/ int unk218;
    /*0x21C*/ int unk21C;
    /*0x220*/ int unk220;
    /*0x224*/ int unk224;
    /*0x228*/ int unk228;
    /*0x22C*/ int unk22C;
    /*0x230*/ int unk230;
    /*0x234*/ int unk234;
    /*0x238*/ int unk238;
    /*0x23C*/ int unk23C;
    /*0x240*/ int unk240;
    /*0x244*/ int unk244;
    /*0x248*/ int unk248;
    /*0x24C*/ int unk24C;
    /*0x250*/ int unk250;
    /*0x254*/ int unk254;
    /*0x258*/ int unk258;
    /*0x25C*/ int unk25C;
    /*0x260*/ int unk260;
    /*0x264*/ int unk264;
    /*0x268*/ int unk268;
    /*0x26C*/ int unk26C;
    /*0x270*/ int unk270;
    /*0x274*/ int unk274;
    /*0x278*/ int unk278;
    /*0x27C*/ int unk27C;
    /*0x280*/ int unk280;
    /*0x284*/ int unk284;
    /*0x288*/ int unk288;
    /*0x28C*/ int unk28C;
    /*0x290*/ int unk290;
    /*0x294*/ int unk294;
    /*0x298*/ int unk298;
    /*0x29C*/ int unk29C;
    /*0x2A0*/ int unk2A0;
    /*0x2A4*/ int unk2A4;
    /*0x2A8*/ int unk2A8;
    /*0x2AC*/ int unk2AC;
    /*0x2B0*/ int unk2B0;
    /*0x2B4*/ int unk2B4;
    /*0x2B8*/ int unk2B8;
    /*0x2BC*/ int unk2BC;
    /*0x2C0*/ int unk2C0;
    /*0x2C4*/ int unk2C4;
    /*0x2C8*/ int unk2C8;
    /*0x2CC*/ int unk2CC;
    /*0x2D0*/ int unk2D0;
    /*0x2D4*/ int unk2D4;
    /*0x2D8*/ int unk2D8;
    /*0x2DC*/ int unk2DC;
    /*0x2E0*/ int unk2E0;
    /*0x2E4*/ int unk2E4;
    /*0x2E8*/ int unk2E8;
    /*0x2EC*/ int unk2EC;
    /*0x2F0*/ int unk2F0;
    /*0x2F4*/ int unk2F4;
    /*0x2F8*/ int unk2F8;
    /*0x2FC*/ int unk2FC;
    /*0x300*/ int unk300;
    /*0x304*/ int unk304;
    /*0x308*/ int unk308;
    /*0x30C*/ int unk30C;
    /*0x310*/ int unk310;
    /*0x314*/ int unk314;
    /*0x318*/ int unk318;
    /*0x31C*/ int unk31C;
    /*0x320*/ int unk320;
    /*0x324*/ int unk324;
    /*0x328*/ int unk328;
    /*0x32C*/ int unk32C;
    /*0x330*/ int unk330;
    /*0x334*/ int unk334;
    /*0x338*/ int unk338;
    /*0x33C*/ int unk33C;
    /*0x340*/ int unk340;
    /*0x344*/ int unk344;
    /*0x348*/ int unk348;
    /*0x34C*/ int unk34C;
    /*0x350*/ int unk350;
    /*0x354*/ int unk354;
    /*0x358*/ int unk358;
    /*0x35C*/ int unk35C;
    /*0x360*/ int unk360;
    /*0x364*/ int unk364;
    /*0x368*/ int unk368;
    /*0x36C*/ int unk36C;
    /*0x370*/ int unk370;
    /*0x374*/ int unk374;
    /*0x378*/ int unk378;
    /*0x37C*/ int unk37C;
    /*0x380*/ int unk380;
    /*0x384*/ int unk384;
    /*0x388*/ int unk388;
    /*0x38C*/ int unk38C;
    /*0x390*/ int unk390;
    /*0x394*/ int unk394;
    /*0x398*/ int unk398;
    /*0x39C*/ int unk39C;
    /*0x3A0*/ int unk3A0;
    /*0x3A4*/ int unk3A4;
    /*0x3A8*/ int unk3A8;
    /*0x3AC*/ int unk3AC;
    /*0x3B0*/ int unk3B0;
    /*0x3B4*/ int unk3B4;
    /*0x3B8*/ int unk3B8;
    /*0x3BC*/ int unk3BC;
    /*0x3C0*/ int unk3C0;
    /*0x3C4*/ int unk3C4;
    /*0x3C8*/ int unk3C8;
    /*0x3CC*/ int unk3CC;
    /*0x3D0*/ int unk3D0;
    /*0x3D4*/ int unk3D4;
    /*0x3D8*/ int unk3D8;
    /*0x3DC*/ int unk3DC;
    /*0x3E0*/ int unk3E0;
    /*0x3E4*/ int unk3E4;
    /*0x3E8*/ int unk3E8;
    /*0x3EC*/ int unk3EC;
    /*0x3F0*/ int unk3F0;
    /*0x3F4*/ int unk3F4;
    /*0x3F8*/ int unk3F8;
    /*0x3FC*/ int unk3FC;
    /*0x400*/ int unk400;
    /*0x404*/ int unk404;
    /*0x408*/ int unk408;
    /*0x40C*/ int unk40C;
    /*0x410*/ int unk410;
    /*0x414*/ int unk414;
    /*0x418*/ int unk418;
    /*0x41C*/ int unk41C;
    /*0x420*/ int unk420;
    /*0x424*/ int unk424;
    /*0x428*/ int unk428;
    /*0x42C*/ int unk42C;
    /*0x430*/ int unk430;
    /*0x434*/ int unk434;
    /*0x438*/ int unk438;
    /*0x43C*/ int unk43C;
    /*0x440*/ int unk440;
    /*0x444*/ int unk444;
    /*0x448*/ int unk448;
    /*0x44C*/ int unk44C;
    /*0x450*/ int unk450;
    /*0x454*/ int unk454;
    /*0x458*/ int unk458;
    /*0x45C*/ int unk45C;
    /*0x460*/ int unk460;
    /*0x464*/ int unk464;
    /*0x468*/ int unk468;
    /*0x46C*/ int unk46C;
    /*0x470*/ int unk470;
    /*0x474*/ int unk474;
    /*0x478*/ int unk478;
    /*0x47C*/ int unk47C;
    /*0x480*/ int unk480;
    /*0x484*/ int unk484;
    /*0x488*/ int unk488;
    /*0x48C*/ int unk48C;
    /*0x490*/ int unk490;
    /*0x494*/ int unk494;
    /*0x498*/ int unk498;
    /*0x49C*/ int unk49C;
    /*0x4A0*/ int unk4A0;
    /*0x4A4*/ int unk4A4;
    /*0x4A8*/ int unk4A8;
    /*0x4AC*/ int unk4AC;
    /*0x4B0*/ int unk4B0;
    /*0x4B4*/ int unk4B4;
    /*0x4B8*/ int unk4B8;
    /*0x4BC*/ int unk4BC;
    /*0x4C0*/ int unk4C0;
    /*0x4C4*/ int unk4C4;
    /*0x4C8*/ int unk4C8;
    /*0x4CC*/ int unk4CC;
    /*0x4D0*/ int unk4D0;
    /*0x4D4*/ int unk4D4;
    /*0x4D8*/ int unk4D8;
    /*0x4DC*/ int unk4DC;
    /*0x4E0*/ int unk4E0;
    /*0x4E4*/ int unk4E4;
    /*0x4E8*/ int unk4E8;
    /*0x4EC*/ int unk4EC;
    /*0x4F0*/ int unk4F0;
    /*0x4F4*/ int unk4F4;
    /*0x4F8*/ int unk4F8;
    /*0x4FC*/ int unk4FC;
    /*0x500*/ int unk500;
    /*0x504*/ int unk504;
    /*0x508*/ int unk508;
    /*0x50C*/ int unk50C;
    /*0x510*/ int unk510;
    /*0x514*/ int unk514;
    /*0x518*/ int unk518;
    /*0x51C*/ int unk51C;
    /*0x520*/ int unk520;
    /*0x524*/ int unk524;
    /*0x528*/ int unk528;
    /*0x52C*/ int unk52C;
    /*0x530*/ int unk530;
    /*0x534*/ int unk534;
    /*0x538*/ int unk538;
    /*0x53C*/ int unk53C;
    /*0x540*/ int unk540;
    /*0x544*/ int unk544;
    /*0x548*/ int unk548;
    /*0x54C*/ int unk54C;
    /*0x550*/ int unk550;
    /*0x554*/ int unk554;
    /*0x558*/ int unk558;
    /*0x55C*/ int unk55C;
    /*0x560*/ int unk560;
    /*0x564*/ int unk564;
    /*0x568*/ int unk568;
    /*0x56C*/ int unk56C;
    /*0x570*/ int unk570;
    /*0x574*/ int unk574;
    /*0x578*/ int unk578;
    /*0x57C*/ int unk57C;
    /*0x580*/ int unk580;
    /*0x584*/ int unk584;
    /*0x588*/ int unk588;
    /*0x58C*/ int unk58C;
    /*0x590*/ int unk590;
    /*0x594*/ int unk594;
    /*0x598*/ int unk598;
    /*0x59C*/ int unk59C;
    /*0x5A0*/ int unk5A0;
    /*0x5A4*/ int unk5A4;
    /*0x5A8*/ int unk5A8;
    /*0x5AC*/ int unk5AC;
    /*0x5B0*/ int unk5B0;
    /*0x5B4*/ int unk5B4;
    /*0x5B8*/ int unk5B8;
    /*0x5BC*/ int unk5BC;
    /*0x5C0*/ int unk5C0;
    /*0x5C4*/ int unk5C4;
    /*0x5C8*/ int unk5C8;
    /*0x5CC*/ int unk5CC;
    /*0x5D0*/ int unk5D0;
    /*0x5D4*/ int unk5D4;
    /*0x5D8*/ int unk5D8;
    /*0x5DC*/ int unk5DC;
    /*0x5E0*/ int unk5E0;
    /*0x5E4*/ int unk5E4;
    /*0x5E8*/ int unk5E8;
    /*0x5EC*/ int unk5EC;
    /*0x5F0*/ int unk5F0;
    /*0x5F4*/ int unk5F4;
    /*0x5F8*/ int unk5F8;
    /*0x5FC*/ int unk5FC;
    /*0x600*/ int unk600;
    /*0x604*/ int unk604;
    /*0x608*/ int unk608;
    /*0x60C*/ int unk60C;
    /*0x610*/ int unk610;
    /*0x614*/ int unk614;
    /*0x618*/ int unk618;
    /*0x61C*/ int unk61C;
    /*0x620*/ int unk620;
    /*0x624*/ int unk624;
    /*0x628*/ int unk628;
    /*0x62C*/ int unk62C;
    /*0x630*/ int unk630;
    /*0x634*/ int unk634;
    /*0x638*/ int unk638;
    /*0x63C*/ int unk63C;
    /*0x640*/ int unk640;
    /*0x644*/ int unk644;
    /*0x648*/ int unk648;
    /*0x64C*/ int unk64C;
    /*0x650*/ int unk650;
    /*0x654*/ int unk654;
    /*0x658*/ int unk658;
    /*0x65C*/ int unk65C;
    /*0x660*/ int unk660;
    /*0x664*/ int unk664;
    /*0x668*/ int unk668;
    /*0x66C*/ int unk66C;
    /*0x670*/ int unk670;
    /*0x674*/ int unk674;
    /*0x678*/ int unk678;
    /*0x67C*/ int unk67C;
    /*0x680*/ int unk680;
    /*0x684*/ int unk684;
    /*0x688*/ int unk688;
    /*0x68C*/ int unk68C;
    /*0x690*/ int unk690;
    /*0x694*/ int unk694;
    /*0x698*/ int unk698;
    /*0x69C*/ int unk69C;
    /*0x6A0*/ int unk6A0;
    /*0x6A4*/ int unk6A4;
    /*0x6A8*/ int unk6A8;
    /*0x6AC*/ int unk6AC;
    /*0x6B0*/ int unk6B0;
    /*0x6B4*/ int unk6B4;
    /*0x6B8*/ int unk6B8;
    /*0x6BC*/ int unk6BC;
    /*0x6C0*/ int unk6C0;
    /*0x6C4*/ int unk6C4;
    /*0x6C8*/ int unk6C8;
    /*0x6CC*/ int unk6CC;
    /*0x6D0*/ int unk6D0;
    /*0x6D4*/ int unk6D4;
    /*0x6D8*/ int unk6D8;
    /*0x6DC*/ int unk6DC;
    /*0x6E0*/ int unk6E0;
    /*0x6E4*/ int unk6E4;
    /*0x6E8*/ int unk6E8;
    /*0x6EC*/ int unk6EC;
    /*0x6F0*/ int unk6F0;
    /*0x6F4*/ int unk6F4;
    /*0x6F8*/ int unk6F8;
    /*0x6FC*/ int unk6FC;
    /*0x700*/ int unk700;
    /*0x704*/ int unk704;
    /*0x708*/ int unk708;
    /*0x70C*/ int unk70C;
    /*0x710*/ int unk710;
    /*0x714*/ int unk714;
    /*0x718*/ int unk718;
    /*0x71C*/ int unk71C;
    /*0x720*/ int unk720;
    /*0x724*/ int unk724;
    /*0x728*/ int unk728;
    /*0x72C*/ int unk72C;
    /*0x730*/ int unk730;
    /*0x734*/ int unk734;
    /*0x738*/ int unk738;
    /*0x73C*/ int unk73C;
    /*0x740*/ int unk740;
    /*0x744*/ int unk744;
    /*0x748*/ int unk748;
    /*0x74C*/ int unk74C;
    /*0x750*/ int unk750;
    /*0x754*/ int unk754;
    /*0x758*/ int unk758;
    /*0x75C*/ int unk75C;
    /*0x760*/ int unk760;
    /*0x764*/ int unk764;
    /*0x768*/ int unk768;
    /*0x76C*/ int unk76C;
    /*0x770*/ int unk770;
    /*0x774*/ int unk774;
    /*0x778*/ int unk778;
    /*0x77C*/ int unk77C;
    /*0x780*/ int unk780;
    /*0x784*/ int unk784;
    /*0x788*/ int unk788;
    /*0x78C*/ int unk78C;
    /*0x790*/ int unk790;
    /*0x794*/ int unk794;
    /*0x798*/ int unk798;
    /*0x79C*/ int unk79C;
    /*0x7A0*/ int unk7A0;
    /*0x7A4*/ int unk7A4;
    /*0x7A8*/ int unk7A8;
    /*0x7AC*/ int unk7AC;
    /*0x7B0*/ int unk7B0;
    /*0x7B4*/ int unk7B4;
    /*0x7B8*/ int unk7B8;
    /*0x7BC*/ int unk7BC;
    /*0x7C0*/ int unk7C0;
    /*0x7C4*/ int unk7C4;
    /*0x7C8*/ int unk7C8;
    /*0x7CC*/ int unk7CC;
    /*0x7D0*/ int unk7D0;
    /*0x7D4*/ int unk7D4;
    /*0x7D8*/ int unk7D8;
    /*0x7DC*/ int unk7DC;
    /*0x7E0*/ int unk7E0;
    /*0x7E4*/ int unk7E4;
    /*0x7E8*/ int unk7E8;
    /*0x7EC*/ int unk7EC;
    /*0x7F0*/ int unk7F0;
    /*0x7F4*/ int unk7F4;
    /*0x7F8*/ int unk7F8;
    /*0x7FC*/ int unk7FC;
    /*0x800*/ int unk800;
    /*0x804*/ int unk804;
    /*0x808*/ int unk808;
    /*0x80C*/ int unk80C;
    /*0x810*/ int unk810;
    /*0x814*/ int unk814;
    /*0x818*/ int unk818;
    /*0x81C*/ int unk81C;
    /*0x820*/ int unk820;
    /*0x824*/ int unk824;
    /*0x828*/ int unk828;
    /*0x82C*/ int unk82C;
    /*0x830*/ int unk830;
    /*0x834*/ int unk834;
    /*0x838*/ int unk838;
    /*0x83C*/ int unk83C;
    /*0x840*/ int unk840;
    /*0x844*/ int unk844;
    /*0x848*/ int unk848;
    /*0x84C*/ int unk84C;
    /*0x850*/ int unk850;
    /*0x854*/ int unk854;
    /*0x858*/ int unk858;
    /*0x85C*/ int unk85C;
    /*0x860*/ int unk860;
    /*0x864*/ int unk864;
    /*0x868*/ int unk868;
    /*0x86C*/ int unk86C;
    /*0x870*/ int unk870;
    /*0x874*/ int unk874;
    /*0x878*/ int unk878;
    /*0x87C*/ int unk87C;
    /*0x880*/ int unk880;
    /*0x884*/ int unk884;
    /*0x888*/ int unk888;
    /*0x88C*/ int unk88C;
    /*0x890*/ int unk890;
    /*0x894*/ int unk894;
    /*0x898*/ int unk898;
    /*0x89C*/ int unk89C;
    /*0x8A0*/ int unk8A0;
    /*0x8A4*/ int unk8A4;
    /*0x8A8*/ int unk8A8;
    /*0x8AC*/ int unk8AC;
    /*0x8B0*/ int unk8B0;
    /*0x8B4*/ int unk8B4;
    /*0x8B8*/ int unk8B8;
    /*0x8BC*/ int unk8BC;
    /*0x8C0*/ int unk8C0;
    /*0x8C4*/ int unk8C4;
    /*0x8C8*/ int unk8C8;
    /*0x8CC*/ int unk8CC;
    /*0x8D0*/ int unk8D0;
    /*0x8D4*/ int unk8D4;
    /*0x8D8*/ int unk8D8;
    /*0x8DC*/ int unk8DC;
    /*0x8E0*/ int unk8E0;
    /*0x8E4*/ int unk8E4;
    /*0x8E8*/ int unk8E8;
    /*0x8EC*/ int unk8EC;
    /*0x8F0*/ int unk8F0;
    /*0x8F4*/ int unk8F4;
    /*0x8F8*/ int unk8F8;
    /*0x8FC*/ int unk8FC;
    /*0x900*/ int unk900;
    /*0x904*/ int unk904;
    /*0x908*/ int unk908;
    /*0x90C*/ int unk90C;
    /*0x910*/ int unk910;
    /*0x914*/ int unk914;
    /*0x918*/ int unk918;
    /*0x91C*/ int unk91C;
    /*0x920*/ int unk920;
    /*0x924*/ int unk924;
    /*0x928*/ int unk928;
    /*0x92C*/ int unk92C;
    /*0x930*/ int unk930;
    /*0x934*/ int unk934;
    /*0x938*/ int unk938;
    /*0x93C*/ int unk93C;
    /*0x940*/ int unk940;
    /*0x944*/ int unk944;
    /*0x948*/ int unk948;
    /*0x94C*/ int unk94C;
    /*0x950*/ int unk950;
    /*0x954*/ int unk954;
    /*0x958*/ int unk958;
    /*0x95C*/ int unk95C;
    /*0x960*/ int unk960;
    /*0x964*/ int unk964;
    /*0x968*/ int unk968;
    /*0x96C*/ int unk96C;
    /*0x970*/ int unk970;
    /*0x974*/ int unk974;
    /*0x978*/ int unk978;
    /*0x97C*/ int unk97C;
    /*0x980*/ int unk980;
    /*0x984*/ int unk984;
    /*0x988*/ int unk988;
    /*0x98C*/ int unk98C;
    /*0x990*/ int unk990;
    /*0x994*/ int unk994;
    /*0x998*/ int unk998;
    /*0x99C*/ int unk99C;
    /*0x9A0*/ int unk9A0;
    /*0x9A4*/ int unk9A4;
    /*0x9A8*/ int unk9A8;
    /*0x9AC*/ int unk9AC;
    /*0x9B0*/ int unk9B0;
    /*0x9B4*/ int unk9B4;
    /*0x9B8*/ int unk9B8;
    /*0x9BC*/ int unk9BC;
    /*0x9C0*/ int unk9C0;
    /*0x9C4*/ int unk9C4;
    /*0x9C8*/ int unk9C8;
    /*0x9CC*/ int unk9CC;
    /*0x9D0*/ int unk9D0;
    /*0x9D4*/ int unk9D4;
    /*0x9D8*/ int unk9D8;
    /*0x9DC*/ int unk9DC;
    /*0x9E0*/ int unk9E0;
    /*0x9E4*/ int unk9E4;
    /*0x9E8*/ int unk9E8;
    /*0x9EC*/ int unk9EC;
    /*0x9F0*/ int unk9F0;
    /*0x9F4*/ int unk9F4;
    /*0x9F8*/ int unk9F8;
    /*0x9FC*/ int unk9FC;
    /*0xA00*/ int unkA00;
    /*0xA04*/ int unkA04;
    /*0xA08*/ int unkA08;
    /*0xA0C*/ int unkA0C;
    /*0xA10*/ int unkA10;
    /*0xA14*/ int unkA14;
    /*0xA18*/ int unkA18;
    /*0xA1C*/ int unkA1C;
    /*0xA20*/ int unkA20;
    /*0xA24*/ int unkA24;
    /*0xA28*/ int unkA28;
    /*0xA2C*/ int unkA2C;
    /*0xA30*/ int unkA30;
    /*0xA34*/ int unkA34;
    /*0xA38*/ int unkA38;
    /*0xA3C*/ int unkA3C;
    /*0xA40*/ int unkA40;
    /*0xA44*/ int unkA44;
    /*0xA48*/ int unkA48;
    /*0xA4C*/ int unkA4C;
    /*0xA50*/ int unkA50;
    /*0xA54*/ int unkA54;
    /*0xA58*/ int unkA58;
    /*0xA5C*/ int unkA5C;
    /*0xA60*/ int unkA60;
    /*0xA64*/ int unkA64;
    /*0xA68*/ int unkA68;
    /*0xA6C*/ int unkA6C;
    /*0xA70*/ int unkA70;
    /*0xA74*/ int unkA74;
    /*0xA78*/ int unkA78;
    /*0xA7C*/ int unkA7C;
    /*0xA80*/ int unkA80;
    /*0xA84*/ int unkA84;
    /*0xA88*/ int unkA88;
    /*0xA8C*/ int unkA8C;
    /*0xA90*/ int unkA90;
    /*0xA94*/ int unkA94;
    /*0xA98*/ int unkA98;
    /*0xA9C*/ int unkA9C;
    /*0xAA0*/ int unkAA0;
    /*0xAA4*/ int unkAA4;
    /*0xAA8*/ int unkAA8;
    /*0xAAC*/ int unkAAC;
    /*0xAB0*/ int unkAB0;
    /*0xAB4*/ int unkAB4;
    /*0xAB8*/ int unkAB8;
    /*0xABC*/ int unkABC;
    /*0xAC0*/ int unkAC0;
    /*0xAC4*/ int unkAC4;
    /*0xAC8*/ int unkAC8;
    /*0xACC*/ int unkACC;
    /*0xAD0*/ int unkAD0;
    /*0xAD4*/ int unkAD4;
    /*0xAD8*/ int unkAD8;
    /*0xADC*/ int unkADC;
    /*0xAE0*/ int unkAE0;
    /*0xAE4*/ int unkAE4;
    /*0xAE8*/ int unkAE8;
    /*0xAEC*/ int unkAEC;
    /*0xAF0*/ int unkAF0;
    /*0xAF4*/ int unkAF4;
    /*0xAF8*/ int unkAF8;
    /*0xAFC*/ int unkAFC;
    /*0xB00*/ int unkB00;
    /*0xB04*/ int unkB04;
    /*0xB08*/ int unkB08;
    /*0xB0C*/ int unkB0C;
    /*0xB10*/ int unkB10;
    /*0xB14*/ int unkB14;
    /*0xB18*/ int unkB18;
    /*0xB1C*/ int unkB1C;
    /*0xB20*/ int unkB20;
    /*0xB24*/ int unkB24;
    /*0xB28*/ int unkB28;
    /*0xB2C*/ int unkB2C;
    /*0xB30*/ int unkB30;
    /*0xB34*/ int unkB34;
    /*0xB38*/ int unkB38;
    /*0xB3C*/ int unkB3C;
    /*0xB40*/ int unkB40;
    /*0xB44*/ int unkB44;
    /*0xB48*/ int unkB48;
    /*0xB4C*/ int unkB4C;
    /*0xB50*/ int unkB50;
    /*0xB54*/ int unkB54;
    /*0xB58*/ int unkB58;
    /*0xB5C*/ int unkB5C;
    /*0xB60*/ int unkB60;
    /*0xB64*/ int unkB64;
    /*0xB68*/ int unkB68;
    /*0xB6C*/ int unkB6C;
    /*0xB70*/ int unkB70;
    /*0xB74*/ int unkB74;
    /*0xB78*/ int unkB78;
    /*0xB7C*/ int unkB7C;
    /*0xB80*/ int unkB80;
    /*0xB84*/ int unkB84;
    /*0xB88*/ int unkB88;
    /*0xB8C*/ int unkB8C;
    /*0xB90*/ int unkB90;
    /*0xB94*/ int unkB94;
    /*0xB98*/ int unkB98;
    /*0xB9C*/ int unkB9C;
    /*0xBA0*/ int unkBA0;
    /*0xBA4*/ int unkBA4;
    /*0xBA8*/ int unkBA8;
    /*0xBAC*/ int unkBAC;
    /*0xBB0*/ int unkBB0;
    /*0xBB4*/ int unkBB4;
    /*0xBB8*/ int unkBB8;
    /*0xBBC*/ int unkBBC;
    /*0xBC0*/ int unkBC0;
    /*0xBC4*/ int unkBC4;
    /*0xBC8*/ int unkBC8;
    /*0xBCC*/ int unkBCC;
    /*0xBD0*/ int unkBD0;
    /*0xBD4*/ int unkBD4;
    /*0xBD8*/ int unkBD8;
    /*0xBDC*/ int unkBDC;
    /*0xBE0*/ int unkBE0;
    /*0xBE4*/ int unkBE4;
    /*0xBE8*/ int unkBE8;
    /*0xBEC*/ int unkBEC;
    /*0xBF0*/ int unkBF0;
    /*0xBF4*/ int unkBF4;
    /*0xBF8*/ int unkBF8;
    /*0xBFC*/ int unkBFC;
    /*0xC00*/ int unkC00;
    /*0xC04*/ int unkC04;
    /*0xC08*/ int unkC08;
    /*0xC0C*/ int unkC0C;
    /*0xC10*/ int unkC10;
    /*0xC14*/ int unkC14;
    /*0xC18*/ int unkC18;
    /*0xC1C*/ int unkC1C;
    /*0xC20*/ int unkC20;
    /*0xC24*/ int unkC24;
    /*0xC28*/ int unkC28;
    /*0xC2C*/ int unkC2C;
    /*0xC30*/ int unkC30;
    /*0xC34*/ int unkC34;
    /*0xC38*/ int unkC38;
    /*0xC3C*/ int unkC3C;
    /*0xC40*/ int unkC40;
    /*0xC44*/ int unkC44;
    /*0xC48*/ int unkC48;
    /*0xC4C*/ int unkC4C;
    /*0xC50*/ int unkC50;
    /*0xC54*/ int unkC54;
    /*0xC58*/ int unkC58;
    /*0xC5C*/ void *unkC5C;
    /*0xC60*/ int unkC60;
    /*0xC64*/ u16 unkC64;
    /*0xC64*/ s16 unkC66;
    /*0xC68*/ int unkC68;
    /*0xC6C*/ int unkC6C;
}PokedexMenu; // 3184


#endif //POKEHEARTGOLD_POKEDEX_H
