#ifndef LISTMENU_POKEDEX_H
#define LISTMENU_POKEDEX_H

typedef struct
{
    int winData;
    u8 flag;
}UnknowWindowData;

typedef struct
{
    /*0x0*/ PokeDexSeacherEngine_TYPE2 *unk0;
    /*0x4*/ int unk4;
    /*0x8*/ int unk8;
    /*0xC*/ int unkC;
    /*0x10*/ int unk10;
    /*0x14*/ int unk14;
    /*0x18*/ int unk18;
    /*0x1C*/ int unk1C;
    /*0x20*/ UnknowWindowData unk20[6];
    /*0x50*/ int unk50;
    /*0x54*/ int unk54;
    /*0x58*/ int unk58;
    /*0x5C*/ int unk5C;
    /*0x60*/ int unk60;
    /*0x64*/ int unk64[SPECIES_MAX];
    /*0xA88*/ int unkA88;
    /*0xA8C*/ int unkA8C;
    /*0xA90*/ int unkA90;
    /*0xA94*/ int unkA94;
    /*0xA98*/ int unkA98;
    /*0xA9C*/ int unkA9C;
    /*0xAA0*/ int unkAA0;
    /*0xAA4*/ int unkAA4;
    /*0xAA8*/ int unkAA8;
    /*0xAAC*/ int unkAAC;
    /*0xAB0*/ int unkAB0;
    /*0xAB4*/ int unkAB4;
    /*0xAB8*/ int unkAB8;
    /*0xABC*/ int unkABC;
    /*0xAC0*/ int unkAC0;
    /*0xAC4*/ int unkAC4;
    /*0xAC8*/ int unkAC8;
    /*0xACC*/ int unkACC;
    /*0xAD0*/ int unkAD0;
    /*0xAD4*/ int unkAD4;
    /*0xAD8*/ int unkAD8;
    /*0xADC*/ int unkADC;
    /*0xAE0*/ int unkAE0;
    /*0xAE4*/ int unkAE4;
    /*0xAE8*/ int unkAE8;
    /*0xAEC*/ int unkAEC;
    /*0xAF0*/ int unkAF0;
    /*0xAF4*/ int unkAF4;
    /*0xAF8*/ int unkAF8;
    /*0xAFC*/ int unkAFC;
    /*0xB00*/ int unkB00;
    /*0xB04*/ int unkB04;
    /*0xB08*/ int unkB08;
    /*0xB0C*/ int unkB0C;
    /*0xB10*/ int unkB10;
    /*0xB14*/ int unkB14;
    /*0xB18*/ int unkB18;
    /*0xB1C*/ int unkB1C;
    /*0xB20*/ int unkB20;
    /*0xB24*/ int unkB24;
    /*0xB28*/ int unkB28;
    /*0xB2C*/ int unkB2C;
    /*0xB30*/ int unkB30;
    /*0xB34*/ int unkB34;
    /*0xB38*/ int unkB38;
    /*0xB3C*/ int unkB3C;
    /*0xB40*/ int unkB40;
    /*0xB44*/ int unkB44;
    /*0xB48*/ int unkB48;
    /*0xB4C*/ int unkB4C;
    /*0xB50*/ int unkB50;
    /*0xB54*/ int unkB54;
    /*0xB58*/ int unkB58;
    /*0xB5C*/ int unkB5C;
    /*0xB60*/ int unkB60;
    /*0xB64*/ int unkB64;
    /*0xB68*/ int unkB68;
    /*0xB6C*/ int unkB6C;
    /*0xB70*/ int unkB70;
    /*0xB74*/ int unkB74;
    /*0xB78*/ int unkB78;
    /*0xB7C*/ int unkB7C;
    /*0xB80*/ int unkB80;
    /*0xB84*/ int unkB84;
    /*0xB88*/ int unkB88;
    /*0xB8C*/ int unkB8C;
    /*0xB90*/ int unkB90;
    /*0xB94*/ int unkB94;
    /*0xB98*/ int unkB98;
    /*0xB9C*/ int unkB9C;
    /*0xBA0*/ int unkBA0;
    /*0xBA4*/ int unkBA4;
    /*0xBA8*/ int unkBA8;
    /*0xBAC*/ int unkBAC;
    /*0xBB0*/ int unkBB0;
    /*0xBB4*/ int unkBB4;
    /*0xBB8*/ int unkBB8;
    /*0xBBC*/ int unkBBC;
    /*0xBC0*/ int unkBC0;
    /*0xBC4*/ int unkBC4;
    /*0xBC8*/ int unkBC8;
    /*0xBCC*/ int unkBCC;
    /*0xBD0*/ int unkBD0;
    /*0xBD4*/ int unkBD4;
    /*0xBD8*/ int unkBD8;
    /*0xBDC*/ int unkBDC;
    /*0xBE0*/ int unkBE0;
    /*0xBE4*/ int unkBE4;
    /*0xBE8*/ int unkBE8;
    /*0xBEC*/ int unkBEC;
    /*0xBF0*/ int unkBF0;
    /*0xBF4*/ int unkBF4;
    /*0xBF8*/ int unkBF8;
    /*0xBFC*/ int unkBFC;
    /*0xC00*/ int unkC00;
    /*0xC04*/ int unkC04;
    /*0xC08*/ int unkC08;
    /*0xC0C*/ int unkC0C;
    /*0xC10*/ int unkC10;
    /*0xC14*/ int unkC14;
    /*0xC18*/ int unkC18;
    /*0xC1C*/ int unkC1C;
    /*0xC20*/ int unkC20;
    /*0xC24*/ int unkC24;
    /*0xC28*/ int unkC28;
    /*0xC2C*/ int unkC2C;
    /*0xC30*/ int unkC30;
    /*0xC34*/ int unkC34;
    /*0xC38*/ int unkC38;
    /*0xC3C*/ int unkC3C;
    /*0xC40*/ int unkC40;
    /*0xC44*/ int unkC44;
    /*0xC48*/ u16 unkC48;
    /*0xC4A*/ u8 unkC4A;
    /*0xC4B*/ u8 unkC4B;
    /*0xC4C*/ int unkC4C;
    /*0xC50*/ int unkC50;
    /*0xC54*/ int unkC54;
    /*0xC58*/ int unkC58;
    /*0xC5C*/ void *unkC5C;
    /*0xC60*/ int unkC60;
    /*0xC64*/ u16 unkC64;
    /*0xC64*/ s16 unkC66;
    /*0xC68*/ int unkC68;
    /*0xC6C*/ int unkC6C;
}PokedexListMenu; // 3184

typedef int (*DexListMenuFunc)(PokedexListMenu *);

#endif //POKEHEARTGOLD_POKEDEX_H