#include "global.h"
#include "main.h"

extern void sub_0203DEB4(int, int);
extern int sub_020267F0(u16, int, u16);
extern void sub_020244B4(int , int, int);
extern void sub_020246F4(int , int, int);
extern int sub_0203DA84(u32*, u32*);
extern int sub_0203DA48(void);
extern int sub_020355B8(int, int, int, int, int);
extern void sub_02006254(int);
extern int sub_0203DAC8(u32*, u32*);

typedef struct
{
    u16 item;
    u16 num;
} BagItemPtr;

typedef struct
{
    /*0x000*/ void *m_GameData;
    /*0x004*/ void *unk4;
    /*0x008*/ void *unk8;
    /*0x00C*/ int unkC;
    /*0x010*/ int unk10;
    /*0x014*/ void *unk14;
    /*0x018*/ void* bagSave;
    /*0x01C*/ int unk1C;
    /*0x020*/int unk20;
    /*0x024*/ BagItemPtr m_itemTable[6];
    /*0x03C*/ u8 unk3C[0x4C0];
    /*0x4FC*/ void *unk4FC;
    /*0x500*/ int unk500;
    /*0x504*/ int unk504;
    /*0x508*/ int unk508;
    /*0x50C*/ int unk50C;
    /*0x510*/ int unk510;
    /*0x514*/ u8 unk514[0xC];
    /*0x520*/ int unk520;
    /*0x524*/ int messageParam;
    /*0x528*/ int unk528;
    /*0x52C*/ int unk52C;
    /*0x530*/ int unk530;
    /*0x534*/ int unk534;
    /*0x538*/ int unk538;
    /*0x53C*/ int unk53C;
    /*0x540*/ int unk540;
    /*0x544*/ int unk544;
    /*0x548*/ int unk548;
    /*0x54C*/ u16 heapId;
    /*0x54E*/ u16 unk54E;
    /*0x550*/ u8 unk550[0x154];
    /*0x6A4*/ int unk6A4;
    /*0x6A8*/ int unk6A8;
    /*0x6AC*/ int unk6AC;
    /*0x6B0*/ int unk6B0;
    /*0x6B4*/ int unk6B4;
    /*0x6B8*/ int unk6B8;
    /*0x6BC*/ u8 unk6BC[0xE0];
    /*0x79C*/ int unk79C;
    /*0x7A0*/ u8 unk7A0[0x8C];
    /*0x82C*/ int itemType;
    /*0x830*/ int posNow;
    /*0x834*/ int unk834;
    /*0x838*/ u32 unk838;
    /*0x83C*/ int unk83C;
    /*0x840*/ int unk840;
    /*0x844*/ int unk844;
    /*0x848*/ int unk848[4];
    /*0x858*/ u8 unk84C[0x3A];
    /*0x892*/ u16 unk892;
    /*0x894*/ int unk894;
    /*0x898*/ int unk898;
    /*0x89C*/ int unk89C;
    /*0x8A0*/ u32 selectItem;
    /*0x8A4*/ int unk8A4;
    /*0x8A8*/ int unk8A8;
    /*0x8AC*/ int unk8AC;
    /*0x8B0*/ int unk8B0;
    /*0x8B4*/ int unk8B4;
    /*0x8B8*/ int unk8B8;
    /*0x8BC*/ int unk8BC;
    /*0x8C0*/ int KeyRetypeIntervalRepeated;
    /*0x8C4*/ int KeyRetypeIntervalFirst;
    /*0x8C8*/ int unk8C8;
    /*0x1F4C*/ int unk1F4C;
    /*0x1F50*/ void *unk1F50;
} BagView; // size of 0x1F54

typedef void (*FieldBagItemUse)(BagView *);

void ovy142_219a1ec(BagView *m_bagView);


void sub_021998C0(BagView *m_bagView, FieldBagItemUse a2);
void sub_021998DC(BagView *m_bagView);
void ovy142_21998f4(BagView *m_bagView);
BagItemPtr* ovy142_2199928(BagView *m_bagView, u32 pocket);
int ovy142_219995c(u32 itemId, int param_2, u16 heapId);
void sub_021999B8(BagView *m_bagView, int bufId, int msgId);
void sub_021999C8(BagView *m_bagView, int bufId, int msgId);
int ovy142_2199988(BagView *m_bagView);

void sub_021998C0(BagView *m_bagView, FieldBagItemUse a2)
{
    m_bagView->unk4FC = a2;
    sub_0203DEB4(m_bagView->KeyRetypeIntervalRepeated, m_bagView->KeyRetypeIntervalFirst);
}

void sub_021998DC(BagView *m_bagView)
{
    m_bagView->unk838 = 0xFFFF;
    ovy142_21998f4(m_bagView);
}

extern int sub_0203D554(void);
extern void ovy142_219de0c(BagView*);
extern void ovy142_219e120(BagView*);
extern void ovy142_219e924(BagView*);
